In [1]:
import numpy as np
import pandas as pd

In [2]:
row_labels = ['Pavan', 'Mohak', 'Mittali', 'Ritika', 'Mohit']
col_labels = ['ACC', 'FIN', 'EAD', 'BDV']

In [39]:
df = pd.DataFrame(data = np.random.randint(60, 101, (5,4)), index = row_labels, columns = col_labels)

In [4]:
df

         ACC  FIN  EAD  BDV
Pavan     79   78   63   72
Mohak     99   92   83   71
Mittali   62   72   89   80
Ritika    61   61   79   85
Mohit     85   84   75   84

In [5]:
df['ACC']

Pavan      79
Mohak      99
Mittali    62
Ritika     61
Mohit      85
Name: ACC, dtype: int64

In [94]:
print(df)
print()
print('First Way: ' + str(df.loc['Pavan']['ACC']))
print('Second Way: ' + str(df.iloc[0, 0]))

         ACC  FIN  EAD  BDV GRADE  TOTAL    AVG
Pavan     91   97   84   97     A    369  92.25
Mohak     62   72   85   70     C    289  72.25
Mittali   67   78   74   96     C    315  78.75
Ritika    68   80   64   65     D    277  69.25
Mohit     96   68   71   65     C    300  75.00

First Way: 91
Second Way: 91

<i>There are two ways to select the value at specific (row, column), such as marks scored by Pavan in Accounting.
    1: df.loc - selects rows and columns using <b>(indexname, column name)</b>
    2: df.iloc - selects rows and columns using <b>(int-index, column-int-index)</b>

In [8]:
df[['EAD', 'ACC']]

         EAD  ACC
Pavan     63   79
Mohak     83   99
Mittali   89   62
Ritika    79   61
Mohit     75   85

In [40]:
df['GRADE'] = 0

In [41]:
df['TOTAL'] = np.sum(df, axis = 1)

In [42]:
df['AVG'] = df['TOTAL'] / 4

In [27]:
df

         ACC  FIN  EAD  BDV  GRADE  TOTAL    AVG
Pavan     79   78   63   72      0    292  73.00
Mohak     99   92   83   71      0    345  86.25
Mittali   62   72   89   80      0    303  75.75
Ritika    61   61   79   85      0    286  71.50
Mohit     85   84   75   84      0    328  82.00

In [96]:
for val in df.index:
    if df.loc[val, 'AVG'] >= 90:
        df.loc[val, 'GRADE'] = 'A'
    elif df.loc[val, 'AVG'] < 70:
        df.loc[val, 'GRADE'] = 'D'
    elif df.loc[val, 'AVG'] >= 80 and df.loc[val, 'AVG'] < 90:
        df.loc[val, 'GRADE'] = 'B'
    else:
        df.loc[val, 'GRADE'] = 'C'

In [107]:
#Computing grades
def computeGrade(x):
    if x >= 90:
        return 'A'
    elif x < 70:
        return 'D'
    elif x >= 80 and x < 90:
        return 'B'
    else:
        return 'C'

df['GRADE'] = list(map(computeGrade, df['AVG']))

In [108]:
df

         ACC  FIN  EAD  BDV GRADE  TOTAL    AVG
Pavan     91   97   84   97     A    369  92.25
Mohak     62   72   85   70     C    289  72.25
Mittali   67   78   74   96     C    315  78.75
Ritika    68   80   64   65     D    277  69.25
Mohit     96   68   71   65     C    300  75.00

<b>Condition when applied to entire dataframe returns a dataframe with boolean values. 
<b>When we use this boolean dataframe to subset data, we get NaN because python imputes NaN at False results.

In [76]:
df[df > 80]

          ACC   FIN   EAD   BDV GRADE  TOTAL    AVG
Pavan    91.0  97.0  84.0  97.0     A    369  92.25
Mohak     NaN   NaN  85.0   NaN     C    289    NaN
Mittali   NaN   NaN   NaN  96.0     C    315    NaN
Ritika    NaN   NaN   NaN   NaN     D    277    NaN
Mohit    96.0   NaN   NaN   NaN     C    300    NaN

Conditional selection returns a dataframe and we can perform all of the valid operations on returned dataframe.

In [74]:
df[df['ACC'] > 80][['ACC', 'FIN', 'GRADE']]

       ACC  FIN GRADE
Pavan   91   97     A
Mohit   96   68     C

Python <b>'and or'</b> operators gives an error when used for multiple condition selection.
Use <b>'& |'</b> instead.
Remember to enclose conditions in paranthesis.

In [113]:
df
df['AVG'] > 90 and df['AVG'] > 70

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [119]:
(df['AVG'] > 60) & (df['AVG'] < 80)

Pavan      False
Mohak       True
Mittali     True
Ritika      True
Mohit       True
Name: AVG, dtype: bool

Missing Data

In [125]:
newdf = df[df > 70]
newdf

          ACC   FIN   EAD   BDV GRADE  TOTAL    AVG
Pavan    91.0  97.0  84.0  97.0     A    369  92.25
Mohak     NaN  72.0  85.0   NaN     C    289  72.25
Mittali   NaN  78.0  74.0  96.0     C    315  78.75
Ritika    NaN  80.0   NaN   NaN     D    277    NaN
Mohit    96.0   NaN  71.0   NaN     C    300  75.00

# Merge Concat and Join

# Concatenate

In [139]:
left = pd.DataFrame(
    {0: 'A0 A1 A2'.split(),
     1: 'B0 B1 B2'.split(),
     2: 'K0 K1 K2'.split()}
)
left.columns = ['A', 'B', 'Key']
left

    A   B Key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

In [140]:
right = pd.DataFrame(
    {0: 'C0 C1 C2'.split(),
     1: 'D0 D1 D2'.split(),
     2: 'K0 K1 K2'.split()}
)
right.columns = ['C', 'D', 'Key']
right

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2

In [146]:
print(left)
print()
print(right)

    A   B Key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

Intersection of keys = inner join,
Keys = {K0 K1 K2}

In [147]:
inner_merged = pd.merge(left=left, right=right, how= 'inner', on='Key')
inner_merged

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

Union of keys = outer join, Keys = {K0, K1, K2, K3}

In [150]:
right.loc[3] = 'C3 D3 K3'.split()
outer_merged = pd.merge(left, right, 'outer', on = 'Key')
outer_merged

     A    B Key   C   D
0   A0   B0  K0  C0  D0
1   A1   B1  K1  C1  D1
2   A2   B2  K2  C2  D2
3  NaN  NaN  K3  C3  D3

Left keys considered, Keys = {K0, K1, K2}

In [151]:
left_merged = pd.merge(left, right, 'left', on = 'Key')
left_merged

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

Right keys considered, Keys = {K0, K1, K2, K3}

In [152]:
right_merged = pd.merge(left, right, 'right', on = 'Key')
right_merged

     A    B Key   C   D
0   A0   B0  K0  C0  D0
1   A1   B1  K1  C1  D1
2   A2   B2  K2  C2  D2
3  NaN  NaN  K3  C3  D3